#+title: The Wire-Cell Workstation Cluster for Users
#+setupfile: ~/org/setup.org
#+setupfile: ~/org/setup-topic.org
#+setupfile: ~/org/setup-darksun.org
#+options: toc:t

** Operating system 
:PROPERTIES:
:CUSTOM_ID: user-os
:END:

A WCWC user workstation must run a supported OS.  The supported OSes may be listed with:

#+begin_src shell :results list :exports both
wcwc oslist
#+end_src

#+RESULTS:
- Debian
  GNU/Linux
  12
  (bookworm)
- Debian
  GNU/Linux
  trixie/sid

Or to check if your workstation runs a supported OS

#+begin_src shell :results none :exports code :noeval
wcwc oscheck
#+end_src
This command is silent unless the OS fails.
Once you have installed a supported OS you must assure vairous OS-level packages are installed with:

#+begin_src shell :results none :exports code :noeval
wcwc osinst
#+end_src
This may prompt you for your ~sudo~ password in order to run ~apt~.

** Spack environment
:PROPERTIES:
:CUSTOM_ID: spack-env
:END:

Spack provides several ways to use the software it provides.  Most involve initial configuration of your shell environment.  Spack supports several popular shells.  To see what are supported:
#+begin_src shell :results list :exports both
ls /wcwc/spack/local/share/spack/setup-env.*
#+end_src

#+RESULTS:
- /wcwc/spack/local/share/spack/setup-env.csh
- /wcwc/spack/local/share/spack/setup-env.fish
- /wcwc/spack/local/share/spack/setup-env.ps1
- /wcwc/spack/local/share/spack/setup-env.sh

Source the one that matches your shell:

#+begin_src shell :results output :exports both :wrap example
source /wcwc/spack/local/share/spack/setup-env.sh
type spack
#+end_src

#+RESULTS:
#+begin_example
spack is a function
spack () 
{ 
    : this is a shell function from: /wcwc/spack/local/share/spack/setup-env.sh;
    : the real spack script is here: /wcwc/spack/local/bin/spack;
    _spack_shell_wrapper "$@";
    return $?
}
#+end_example

#+begin_note
Spack's "setup" script defines a /shell function/ named ~spack~ in addition to placing the ~spack~ program in your ~$PATH~.  Both are effectively identical but the shell function form is able to further modify your shell environment.  After "sourcing" the setup script, the function is used when calling ~spack~.  alternatively, you may wish to start a /subshell/ to contain Spack environment changes: ~bash --rcfile /wcwc/spack/local/share/spack/setup-env.sh~
#+end_note


